УДУПР/src/InformationRegisters/пр_НастройкиРаботыМодулейМетодов/пр_НастройкиРаботыМодулейМетодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пр_НастройкиРаботыМодулейМетодов</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПутьКОбработкеОтладки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОбработкуБСП</name>
    <comment>При отладке</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаОтладкиБСП</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоИсполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Модуль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.пр_ЗадачиРазработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерИзменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УДУПР/src/InformationRegisters/пр_НастройкиРаботыМодулейМетодов/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПутьКОбработкеОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписОповещФормы = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма); //ЭтаФорма, ЭтотОбъект
	пр_Клиент.УстановкаКаталогаФайлаНачалоВыбора(ЭтаФорма, "ПутьКОбработкеОтладки", ,,, ОписОповещФормы);
	
КонецПроцедуры  


&НаКлиенте
//Какие параметры могут передаваться:
//ПараметрыЗакрытия, СтандартныеРеквизиты, ФормаРедактированияСтроки, СтруктураПараметров, ВыполняемоеОповещение, Результат, ИсточникВыбора 
Процедура ПослеВыбораФайла(Результат, Параметры) Экспорт 
	
	ПутьКОбработке = Результат; 	
	Если ЗначениеЗаполнено(ПутьКОбработке)  Тогда
		Запись.ПутьКОбработкеОтладки = ПутьКОбработке;
		Запись.Использовать = Истина;
		Если НЕ ЗначениеЗаполнено(Запись.Модуль)  Тогда
			МассивыПути = СтрРазделить(ПутьКОбработке, "/\");
			ИмяФайла = МассивыПути[МассивыПути.ВГраница()];
			Запись.Модуль = СтрРазделить(ИмяФайла, ".")[0];
		КонецЕсли;
	Иначе 
		Запись.Использовать = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
